// Lab_03_1.cpp
// < Пастух Оксани >
// Лабораторна робота № 3.1
// Розгалуження , задане формулою : функція однієї змінної.
// Варіант 14

 #include <iostream>
 #include <cmath>
using namespace std;

int main()
{
	double x; // вхідний параметр 
	double y; // результат обчислення виразу 
	double A; // проміжний результат - функціонально стала частина виразу
	double B; // проміжний результат - функціонально змінна частина виразу

	cout << "x = "; cin >> x;

	A = fabs(4 * (x)-1);

	// спосіб 1 : розгалуження в скороченій формі
	if (x < 0)
		B = (x * x * x * x * x * x * x) - 2 * (x);
	if (0 <= x && x < 3)
		B = atan2(exp(x) + 1, 8);
	if (x >= 3)
		B = (x * x * x * x) + exp((x * x) + 3);
	y = A + B;
	cout << "1) y = " << y << endl;


	// спосіб 2 : розгалуження в повній формі
	if (x<0)
		B = (x * x * x * x * x * x * x) - 2 * (x);
	else
		if (0 <= x && x < 3)
			B = atan2(exp(x) + 1, 8);
		else
			B = (x * x * x * x) + exp((x * x) + 3);
	y = A + B;

	cout << "2) y = " << y << endl;

	cin.get();
	return 0;
}

